import {
  u as o,
  _ as e,
} from "./WrapperPost.vue_vue_type_script_setup_true_lang-d5S1uDSL.js";
import { _ as a } from "./commentBox.vue_vue_type_style_index_0_lang-BMSLJoC-.js";
import {
  o as m,
  c as u,
  w as d,
  a as l,
  b as n,
  d as p,
} from "./app-CVuLZ3l0.js";
const b = "/images/bmwk-2.png",
  f = "/images/bmwk-1-1.png",
  g = "/images/bmwk-3.png",
  w = "/images/bmwk-4.png",
  k = "/images/bmwk-1.png",
  x = { class: "prose m-auto slide-enter-content" },
  $ = {
    __name: "bmwk",
    setup(v) {
      const i = {
        title: "黑神话:悟空 —— 全成就完结",
        subtitle: "踏上取经路，比抵达灵山更重要",
        date: "2024-09-17T02:00:00.000Z",
        type: "game",
        place: "灵山",
        meta: [
          { property: "og:title", content: "黑神话:悟空 —— 全成就完结" },
          { name: "twitter:title", content: "黑神话:悟空 —— 全成就完结" },
        ],
      };
      return (
        o({
          title: "黑神话:悟空 —— 全成就完结",
          meta: [
            { property: "og:title", content: "黑神话:悟空 —— 全成就完结" },
            { name: "twitter:title", content: "黑神话:悟空 —— 全成就完结" },
          ],
        }),
        (B, t) => {
          const s = a,
            r = e;
          return (
            m(),
            u(
              r,
              { frontmatter: i },
              {
                default: d(() => [
                  l("div", x, [
                    t[0] ||
                      (t[0] = l(
                        "p",
                        null,
                        [
                          l("div", { class: "table-of-contents" }, [
                            l("div", { class: "table-of-contents-anchor" }, [
                              l("div", { class: "i-ri-menu-2-fill" }),
                            ]),
                            l("ul", null, [
                              l("li", null, [
                                l("a", { href: "#游戏玩法" }, "游戏玩法 "),
                              ]),
                              l("li", null, [
                                l("a", { href: "#战斗体验" }, "战斗体验 "),
                              ]),
                              l("li", null, [
                                l("a", { href: "#故事剧情" }, "故事剧情 "),
                              ]),
                              l("li", null, [
                                l("a", { href: "#吐槽" }, "吐槽 "),
                              ]),
                              l("li", null, [
                                l("a", { href: "#最后" }, "最后 "),
                              ]),
                            ]),
                          ]),
                        ],
                        -1,
                      )),
                    t[1] ||
                      (t[1] = l(
                        "p",
                        null,
                        [
                          n("历经81小时也终于是完成了九九八十一难! "),
                          l("img", { src: b, alt: "81全成就" }),
                        ],
                        -1,
                      )),
                    t[2] ||
                      (t[2] = l(
                        "p",
                        null,
                        "真的是感触良多，总体评价一下吧~",
                        -1,
                      )),
                    t[3] ||
                      (t[3] = l(
                        "h3",
                        { id: "游戏玩法", tabindex: "-1" },
                        [
                          n("游戏玩法 "),
                          l(
                            "a",
                            {
                              class: "header-anchor",
                              href: "#游戏玩法",
                              "aria-hidden": "true",
                            },
                            "#",
                          ),
                        ],
                        -1,
                      )),
                    t[4] ||
                      (t[4] = l(
                        "p",
                        null,
                        "主体玩法上其实还是类魂的角色扮演，主要的游玩模式也是线性的箱庭探索。但是！没有魂游的那种死亡掉落惩罚，所以完全不用担心在小怪的战斗中或是某个关键节点死亡，在养成上是没有任何负担的",
                        -1,
                      )),
                    t[5] ||
                      (t[5] = l(
                        "p",
                        null,
                        "其次，作为主角的天命人有一个我一直觉着很bt的推图方式，就是跑蓄劈棍，哪怕打到了大后期的火焰山地图，这三豆蓄力跑蓄依旧能给小怪两棒子劈死，这意味着什么？意味着推图几乎是无消耗的，不会类似于只狼或者是艾尔登法环，boss还没找到，就被小怪耗到半死了。黑猴的推图，几乎是无消耗的，再加上图中还会有很多悬浮在空中的残留精魄可以补充葫芦。所以推图的过程中，你可以尽情的去探索，去挑战，去尝试，去体验。",
                        -1,
                      )),
                    t[6] ||
                      (t[6] = l(
                        "h3",
                        { id: "战斗体验", tabindex: "-1" },
                        [
                          n("战斗体验 "),
                          l(
                            "a",
                            {
                              class: "header-anchor",
                              href: "#战斗体验",
                              "aria-hidden": "true",
                            },
                            "#",
                          ),
                        ],
                        -1,
                      )),
                    t[7] ||
                      (t[7] = l(
                        "p",
                        null,
                        "关于战斗，我只能说，很满意！ 天命人角色运动性能很高，翻滚无敌帧长，再加上众多法术加持，绝大多数情况下几乎是不会卡关的，对于我来说80%以上的boss都是初见过，不存在卡关很长的情况",
                        -1,
                      )),
                    t[8] ||
                      (t[8] = l(
                        "p",
                        null,
                        "我本人本就是一个爱搞基本功的玩家，只狼（8周目双难通关全成就）艾尔登法环（3周目全成就） 我从第一章学到了识破技能以后，几乎就是边打边练，游玩全程都有在使用识破，熟练后非常好使！！！ 所以也就更不会卡关了哈哈哈哈 这里附上当时打的禁字绝无伤识破寅虎的视频~",
                        -1,
                      )),
                    t[9] ||
                      (t[9] = l(
                        "p",
                        null,
                        [
                          l(
                            "a",
                            {
                              href: "https://www.bilibili.com/video/BV17YswexE9g",
                              class:
                                "markdown-magic-link markdown-magic-link-link",
                              target: "_blank",
                              rel: "noopener",
                            },
                            [
                              l("span", {
                                class: "markdown-magic-link-image",
                                style: {
                                  "background-image":
                                    "url('https://favicon.yandex.net/favicon/www.bilibili.com')",
                                },
                              }),
                              n("禁字决无伤识破寅虎"),
                            ],
                          ),
                        ],
                        -1,
                      )),
                    t[10] ||
                      (t[10] = l(
                        "p",
                        null,
                        "但是，关于战斗上依旧有我认为可以优化的地方",
                        -1,
                      )),
                    t[11] ||
                      (t[11] = l(
                        "ul",
                        null,
                        [
                          l(
                            "li",
                            null,
                            "劈棍势的识破：对于新手来说太难触发了，不光要注意boss的出招，还需要自身处于普攻状态，还有很重要的一点，就是棍子的普攻不是任何时候都可以直接转切手技的，特别是第三下的死亡前摇，真的巨长，很多时候就是因为普攻刚好卡在第三下没法切手技导致被boss哐哐砍，希望游科可以优化一下棍模组的切手机可触发时机（所以为什么枪模组是任意时刻都能切手技？？？）",
                          ),
                          l(
                            "li",
                            null,
                            "视角问题：这个问题说严重也不严重，但是多少是影响了游戏体验，就比如小地图的战斗，角色一旦贴边，视角会变得很别扭，",
                          ),
                          l(
                            "li",
                            null,
                            "切换锁定目标的手感：太厚重啦！！！很多游戏的切换目标只需要轻轻的挪一下摇杆（鼠标），但是黑猴的切换锁定目标的阈值太大了，导致会需要很明显的挪动才可以切换。就比如和一堆天兵的战斗，那转视角的手感，头皮发麻！",
                          ),
                          l(
                            "li",
                            null,
                            "大型boss卡模型：这个或许是行业通病吧，我玩到很多类似的游戏都会有这个问题，但是黑猴算是比较严重的了，面对大型boss很容易空挥棒子，白白浪费定身时间，相信这个大家也有所体会",
                          ),
                          l(
                            "li",
                            null,
                            "流派不平衡：劈棍和戳棍都有强势玩法，但是立棍到了后期几乎是个摆设，强度总体偏低，希望游科可以优化一下立棍的玩法，让立棍也有一立之地",
                          ),
                        ],
                        -1,
                      )),
                    t[12] ||
                      (t[12] = l(
                        "h3",
                        { id: "故事剧情", tabindex: "-1" },
                        [
                          n("故事剧情 "),
                          l(
                            "a",
                            {
                              class: "header-anchor",
                              href: "#故事剧情",
                              "aria-hidden": "true",
                            },
                            "#",
                          ),
                        ],
                        -1,
                      )),
                    t[13] ||
                      (t[13] = l(
                        "p",
                        null,
                        "我只能说黑猴的故事情节yyds！我已经受够了魂类游戏过于隐晦的故事叙述，想理清魂游的故事思路，就得一字一句的看相关物件晦涩难懂的文本，还要从每一个谜语人口中钻研细枝末节，我相信对于大部分人来说，玩完黑魂、艾尔登法环之后，对于故事的情节还是一知半解，不看点解说视频，真的是难以洞悉故事全貌",
                        -1,
                      )),
                    t[14] ||
                      (t[14] = l(
                        "p",
                        null,
                        "但是黑神话悟空对于故事的叙事真的太明了了，所有的boss、小怪都有对应的隐神图，你可以很容易的看明白每一个角色前生今世。",
                        -1,
                      )),
                    t[15] ||
                      (t[15] = l(
                        "p",
                        null,
                        "当然还有最重要的中文配音，终于体验到不用看字幕是多么的爽快了，还有每当听到游戏中充满寓意的诗词和谚语时，真的会有种发自内心的欢喜",
                        -1,
                      )),
                    t[16] ||
                      (t[16] = l(
                        "h3",
                        { id: "吐槽", tabindex: "-1" },
                        [
                          n("吐槽 "),
                          l(
                            "a",
                            {
                              class: "header-anchor",
                              href: "#吐槽",
                              "aria-hidden": "true",
                            },
                            "#",
                          ),
                        ],
                        -1,
                      )),
                    t[17] ||
                      (t[17] = l(
                        "p",
                        null,
                        "夸归夸，黑猴依旧有很多槽点或者是需要优化的地方",
                        -1,
                      )),
                    t[18] ||
                      (t[18] = l(
                        "ul",
                        null,
                        [
                          l(
                            "li",
                            null,
                            "首先是游戏的吃药喝葫芦手感，真的很奇怪，每次翻身准备喝的时候，总是会有中卡个一两秒才能喝",
                          ),
                          l(
                            "li",
                            null,
                            "然后就是老生常谈的空气墙，探图很有意思，也很有乐趣，但是每当撞到莫名其妙的空气墙后，对于探索的乐趣会直线下滑，明明是条路玩前一撞却是个空气墙，真的很恼火哇！",
                          ),
                          l(
                            "li",
                            null,
                            "关卡设计，这个暂且可以理解游科在这方面的青涩，但是游戏后期的关卡质量，我只能说是真的没有到位呀，结合当时记者对游科的采访，应该是为了上线做出的大量的删减和赶工，希望游科可以在后续的dlc中补充一些关卡，让玩家有更多的探索空间",
                          ),
                        ],
                        -1,
                      )),
                    t[19] ||
                      (t[19] = l(
                        "h3",
                        { id: "最后", tabindex: "-1" },
                        [
                          n("最后 "),
                          l(
                            "a",
                            {
                              class: "header-anchor",
                              href: "#最后",
                              "aria-hidden": "true",
                            },
                            "#",
                          ),
                        ],
                        -1,
                      )),
                    t[20] ||
                      (t[20] = l(
                        "p",
                        null,
                        "真的真的真的非常欣慰，国产有些也能达到如此高的水准，希望黑神话悟空不是顶点而是国产游戏崛起的的起点！",
                        -1,
                      )),
                    t[21] ||
                      (t[21] = l(
                        "p",
                        null,
                        [
                          l("img", { src: f, alt: "黑猴美学" }),
                          l("img", { src: g, alt: "大战前夕" }),
                          l("img", { src: w, alt: "势均力敌" }),
                          l("img", { src: k, alt: "永远值得" }),
                        ],
                        -1,
                      )),
                    p(s),
                  ]),
                ]),
                _: 1,
              },
            )
          );
        }
      );
    },
  };
export { $ as default };
